## Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd
import os

In [2]:
df=pd.read_csv("titanic.csv")

In [3]:
df.head(6)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S

In [4]:
df.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
df.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [6]:
df.nunique()

PassengerId    418
Pclass           3
Name           418
Sex              2
Age             79
SibSp            7
Parch            8
Ticket         363
Fare           169
Cabin           76
Embarked         3
dtype: int64

In [7]:
df.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
data = {
  "A": [50, 40, 30, 40],
  "B": [70,60,40,30],
    "C":[40,20,50,60]
}
idx = ["Sally", "Mary", "John", "Monica"]
df = pd.DataFrame(data, index=idx)
df

         A   B   C
Sally   50  70  40
Mary    40  60  20
John    30  40  50
Monica  40  30  60

In [9]:
df = df.reset_index(drop=True)
df.index = df.index * 2 + 1
df

    A   B   C
1  50  70  40
3  40  60  20
5  30  40  50
7  40  30  60

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
## For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [10]:
data = {"Values": [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
# sum
values_column = df['Values']
sum_of_first_three = sum(values_column[:3])
print("Sum of the first three values:", sum_of_first_three)

Sum of the first three values: 60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [11]:
data={"Text":["dog","cat","fish"]}
df = pd.DataFrame(data)
df

   Text
0   dog
1   cat
2  fish

In [12]:
# new column
df['Word_Count']=df['Text'].str.len()
df

   Text  Word_Count
0   dog           3
1   cat           3
2  fish           4

## Q5. How are DataFrame.size() and DataFrame.shape() different?

### DataFrame.size returns the total number of elements in the DataFrame, which is calculated by multiplying the number of rows by the number of columns.
### The DataFrame.shape attribute returns a tuple in the form (rows, columns).

## Q6. Which function of pandas do we use to read an excel file?

#### pd.read_excel("file.filename.xlsx")

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [13]:
data={"Email":["metech@mail","mohit@mail"]}
df = pd.DataFrame(data)
df['Username'] = df['Email'].str.split('@').str[0]
df

         Email Username
0  metech@mail   metech
1   mohit@mail    mohit

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:
#####  _  A B C
##### 0 3 5 1
##### 1 8 2 7
##### 2 6 9 4
##### 3 2 3 5
##### 4 9 1 2

In [14]:
data={"A":[3,8,6,2,9],"B":[5,3,9,3,1],"C":[1,7,4,5,2]}
df=pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  3  7
2  6  9  4
3  2  3  5
4  9  1  2

In [15]:
new_df=df[(df["A"]>5) & (df["B"]<10)]
new_df

   A  B  C
1  8  3  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [16]:
data = {"Values": [10,15,20,25,30,40,15,50,10]}
df = pd.DataFrame(data)
# mean
df.mean()

Values    23.888889
dtype: float64

In [17]:
# median
df.median()

Values    20.0
dtype: float64

In [18]:
#mode
df.mode()

   Values
0      10
1      15

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [19]:
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08'], 
                   'Sales': [10, 20, 30, 40, 50, 60, 70, 80]})

df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime format

df = df.sort_values('Date')  # Sort DataFrame by 'Date' column in ascending order

#  use the rolling()
df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

df

        Date  Sales  MovingAverage
0 2023-01-01     10           10.0
1 2023-01-02     20           15.0
2 2023-01-03     30           20.0
3 2023-01-04     40           25.0
4 2023-01-05     50           30.0
5 2023-01-06     60           35.0
6 2023-01-07     70           40.0
7 2023-01-08     80           50.0

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:
#### ___ Date
##### 0 2023-01-01
##### 1 2023-01-02
##### 2 2023-01-03
##### 3 2023-01-04
##### 4 2023-01-05
#### Your function should create the following DataFrame:

#### _ Date_____    Weekday__
##### 0 2023-01-01 Sunday
##### 1 2023-01-02 Monday
##### 2 2023-01-03 Tuesday
##### 3 2023-01-04 Wednesday
##### 4 2023-01-05 Thursday
### The function should return the modified DataFrame.

In [20]:
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08']})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08

In [21]:
# with weekdays 
df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime format
df['Weekday'] = df['Date'].dt.day_name()
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday
6 2023-01-07   Saturday
7 2023-01-08     Sunday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [22]:
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-02-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-03-07', '2023-01-08']})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-02-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-03-07
7  2023-01-08

 ### 2023-01-01 - 2023-01-31

In [23]:
df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime format
selected_df=df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
selected_df

        Date
0 2023-01-01
1 2023-01-02
3 2023-01-04
4 2023-01-05
5 2023-01-06
7 2023-01-08

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

### pandas library is to be imported at first as:
###### import pandas as pd